In [22]:
# https://docs.scipy.org/doc/numpy/user/quickstart.html
import numpy as np
x = np.array([0, 1, 2, 3])
x

array([0, 1, 2, 3])

In [23]:
x * 2

array([0, 2, 4, 6])

In [24]:
x**2

array([0, 1, 4, 9])

In [13]:
import pandas as pd

In [18]:
df = pd.read_csv('untitled.txt')
df

    id   dept  salary  age
0  123     HR   88000   43
1  234   Engg   90000   35
2  345  Sales  100000   36
3  456     HR   90000   40
4  567   Engg   70000   27

In [19]:
df[df['dept']=='HR']

    id dept  salary  age
0  123   HR   88000   43
3  456   HR   90000   40

In [25]:
df['name'] = ['A','B','C','D','E']

In [26]:
df

    id   dept  salary  age name
0  123     HR   88000   43    A
1  234   Engg   90000   35    B
2  345  Sales  100000   36    C
3  456     HR   90000   40    D
4  567   Engg   70000   27    E

In [27]:
df[df['name'] == 'C']

    id   dept  salary  age name
2  345  Sales  100000   36    C